zenes/esp32s3-TAS/esp-idf-examples/tas/main/main.cpp
volatile uint32_t last_render_time_ms = 0;

// LVGL 모니터링 콜백 (렌더링 소요 시간 직관적 측정용)
void my_monitor_cb(lv_disp_drv_t * disp_drv, uint32_t time, uint32_t px) {
  // 화면 갱신 시 소요된 렌더링 시간을 저장
  if (time > 0) {
    last_render_time_ms = time;
  }
}

// Network state
// ============================================================================
// Network Configuration (Static IP)
// Set USE_STATIC_IP to true if you want to use a static IP address.
// This is useful if DHCP is not available or slow (Example: Corporate Network).
// ============================================================================
#define USE_STATIC_IP true // Set to true to enable Static IP

#if USE_STATIC_IP
// Please change these values to match your network environment
IPAddress local_ip(192, 168, 0, 50);
IPAddress gateway(192, 168, 0, 100); // Set gateway to Device A (Direct Connect)
IPAddress subnet(255, 255, 255, 0);
IPAddress dns1(8, 8, 8, 8);
IPAddress dns2(8, 8, 4, 4);
#endif

// Network state
static bool eth_connected = false;
static bool ap_started = false;

/**
 * @brief Dynamic LCD hardware detection
 * @return true if LCD is detected, false otherwise
 */
bool detectLCD() {
#if defined(ESP32_S3_LCD_EV_BOARD_2) || defined(TFT_PARALLEL_16_BIT) || defined(TFT_PARALLEL_8_BIT)
  Serial.println("Board/Parallel Mode Detected. Skipping SPI probing.");
  return true; 
#else
  Serial.print("Probing LCD hardware... ");
  
  // Use SPI2 (FSPI) to avoid conflict with Ethernet (SPI3) on some boards
  static SPIClass* spi_p = nullptr;
  if (!spi_p) spi_p = new SPIClass(FSPI); 

#if defined(TFT_SCLK) && defined(TFT_MISO) && defined(TFT_MOSI) && defined(TFT_CS)
  spi_p->begin(TFT_SCLK, TFT_MISO, TFT_MOSI, TFT_CS);
#endif
  
#if defined(TFT_MISO)
  pinMode(TFT_MISO, INPUT_PULLUP);
#endif
#if defined(TFT_CS)
  pinMode(TFT_CS, OUTPUT);
#endif
#if defined(TFT_DC)
  pinMode(TFT_DC, OUTPUT);
#endif
#if defined(TFT_RST)
  pinMode(TFT_RST, OUTPUT);
#endif

  // Hardware Reset
  digitalWrite(TFT_RST, LOW);
  delay(100); 
  digitalWrite(TFT_RST, HIGH);
  delay(200); 
  
  digitalWrite(TFT_CS, LOW);
  delay(5); 
  
  spi_p->beginTransaction(SPISettings(1000000, MSBFIRST, SPI_MODE0));
  
  // Multiple ID probe (ST7789 requires 1-byte dummy before parameter)
  auto readID = [&](uint8_t cmd) {
    digitalWrite(LCD_DC_PIN, LOW); spi_p->transfer(cmd);
    digitalWrite(LCD_DC_PIN, HIGH);
    spi_p->transfer(0x00); // Dummy Byte
    return spi_p->transfer(0x00); // Real ID
  };

  uint8_t id1 = readID(0xDA);
  uint8_t id2 = readID(0xDB);
  uint8_t id3 = readID(0xDC);
  
  spi_p->endTransaction();
  digitalWrite(LCD_CS_PIN, HIGH);
  
  bool detected = (id1 != 0x00 && id1 != 0xFF) || (id2 != 0x00 && id2 != 0xFF) || (id3 != 0x00 && id3 != 0xFF);

  if (detected) {
    Serial.printf("Done. LCD Detected (ID:%02X%02X%02X)\n", id1, id2, id3);
  } else {
    Serial.println("Failed. LCD not found.");
  }
  #ifdef LCD_TYPE_ILI9341
  detected = true;
  Serial.println("Force initializing.");
  #endif
  
  return detected;
#endif
}

/**
 * @brief Initialize LVGL UI widgets
 */
void initLVGLUI() {
  lv_obj_t *scr = lv_scr_act();
  if (!scr) return;
  lv_obj_set_scrollbar_mode(scr, LV_SCROLLBAR_MODE_OFF); // 스크롤바 숨김

#ifdef ENABLE_GRADIENT_BG
  // 짙은 파란색 계열 그라데이션 테마 적용
  lv_obj_set_style_bg_color(scr, lv_color_make(15, 20, 35), 0);
  lv_obj_set_style_bg_grad_color(scr, lv_color_make(30, 45, 65), 0);
  lv_obj_set_style_bg_grad_dir(scr, LV_GRAD_DIR_VER, 0);
#else
  // 단색 배경 (매크로 비활성화 시)
  lv_obj_set_style_bg_color(scr, lv_color_make(0, 0, 0), 0);
#endif
  
  // 화면 잘림 현상을 확인하기 위한 전체 테두리 (디버깅용)
  lv_obj_set_style_border_color(scr, lv_color_make(255, 255, 255), 0);
  lv_obj_set_style_border_width(scr, 2, 0);
  lv_obj_set_style_pad_all(scr, 0, 0); // 패딩 제거로 모서리까지 꽉 차게 변경

  /* Title */
  lv_obj_t *title = lv_label_create(scr);
  lv_label_set_text(title, "TAS Bridge");
  lv_obj_set_style_text_font(title, &lv_font_montserrat_14, 0);
  lv_obj_set_style_text_color(title, lv_palette_main(LV_PALETTE_YELLOW), 0);
  lv_obj_align(title, LV_ALIGN_TOP_MID, 0, 10);
  lv_obj_add_flag(title, LV_OBJ_FLAG_HIDDEN); // 숨김

  /* Debug Panel */
  ui_debug_panel = lv_obj_create(scr);
  lv_obj_set_size(ui_debug_panel, 175, LV_SIZE_CONTENT);
  lv_obj_align(ui_debug_panel, LV_ALIGN_RIGHT_MID, -10, 0); // 화면 우측 중앙(y=120)으로 정렬
  // 디버그 패널 자체는 살리고 내부 글씨들만 골라서 숨김
  lv_obj_set_style_bg_color(ui_debug_panel, lv_color_make(20, 20, 20), 0); // 어두운 회색/검정
  lv_obj_set_style_bg_opa(ui_debug_panel, LV_OPA_90, 0); // 약간의 투명도
  lv_obj_set_style_border_width(ui_debug_panel, 1, 0);
  lv_obj_set_style_border_color(ui_debug_panel, lv_color_make(70, 70, 70), 0);
  lv_obj_set_style_pad_all(ui_debug_panel, 8, 0);
  
  // 패널 내부를 Flex(세로 정렬) 레이아웃으로 설정
  lv_obj_set_layout(ui_debug_panel, LV_LAYOUT_FLEX);
  lv_obj_set_flex_flow(ui_debug_panel, LV_FLEX_FLOW_COLUMN);
  lv_obj_set_flex_align(ui_debug_panel, LV_FLEX_ALIGN_START, LV_FLEX_ALIGN_START, LV_FLEX_ALIGN_START);
  lv_obj_set_style_pad_row(ui_debug_panel, 4, 0); // 줄 간격

  /* Title of Debug Panel */
  lv_obj_t *debug_title = lv_label_create(ui_debug_panel);
  lv_label_set_text(debug_title, "DEBUG INFO");
  lv_obj_set_style_text_font(debug_title, &lv_font_montserrat_14, 0);
  lv_obj_set_style_text_color(debug_title, lv_palette_main(LV_PALETTE_LIGHT_BLUE), 0);
  lv_obj_add_flag(debug_title, LV_OBJ_FLAG_HIDDEN); // 숨김

  /* FPS Label */
  ui_label_fps = lv_label_create(ui_debug_panel);
  lv_obj_set_style_text_font(ui_label_fps, &lv_font_montserrat_14, 0);
  lv_obj_set_style_text_color(ui_label_fps, lv_color_white(), 0);
  lv_label_set_text(ui_label_fps, "FPS: 0");

  /* Target FPS Label */
  ui_label_tgt_fps = lv_label_create(ui_debug_panel);
  lv_obj_set_style_text_font(ui_label_tgt_fps, &lv_font_montserrat_14, 0); 
  lv_obj_set_style_text_color(ui_label_tgt_fps, lv_palette_main(LV_PALETTE_ORANGE), 0);
  lv_obj_add_flag(ui_label_tgt_fps, LV_OBJ_FLAG_HIDDEN); // 숨김
#ifdef LV_DISP_DEF_REFR_PERIOD
  lv_label_set_text_fmt(ui_label_tgt_fps, "TGT: %d FPS", 1000 / LV_DISP_DEF_REFR_PERIOD);
#else
  lv_label_set_text(ui_label_tgt_fps, "TGT: 33 FPS"); // LVGL 기본 모니터 주기(30ms)
#endif

  /* SPI Clock Label */
  ui_label_spi = lv_label_create(ui_debug_panel);
  lv_obj_set_style_text_font(ui_label_spi, &lv_font_montserrat_14, 0); 
  lv_obj_set_style_text_color(ui_label_spi, lv_palette_main(LV_PALETTE_LIGHT_GREEN), 0);
  lv_obj_add_flag(ui_label_spi, LV_OBJ_FLAG_HIDDEN); // 숨김
#ifdef SPI_FREQUENCY
  lv_label_set_text_fmt(ui_label_spi, "SPI: %d MHz", SPI_FREQUENCY / 1000000);
#else
  lv_label_set_text(ui_label_spi, "SPI: 80 MHz");
#endif

#ifdef ENABLE_TE_SYNC
  /* TE Timing Label */
  ui_label_te = lv_label_create(ui_debug_panel);
  lv_obj_set_style_text_font(ui_label_te, &lv_font_montserrat_14, 0); 
  lv_obj_set_style_text_color(ui_label_te, lv_palette_main(LV_PALETTE_YELLOW), 0);
  // lv_obj_add_flag(ui_label_te, LV_OBJ_FLAG_HIDDEN); // 다시 표시되도록 주석 처리
  lv_label_set_text(ui_label_te, "TE: --");
#endif

  /* Core 0 CPU Load Label (System/Net Core) */
  ui_label_cpu0 = lv_label_create(ui_debug_panel);
  lv_obj_set_style_text_font(ui_label_cpu0, &lv_font_montserrat_14, 0);
  lv_obj_set_style_text_color(ui_label_cpu0, lv_palette_main(LV_PALETTE_CYAN), 0);
  lv_label_set_text(ui_label_cpu0, "C0:  0.0%");

  /* Core 1 CPU Load Label (App/UI Core) */
  ui_label_cpu1 = lv_label_create(ui_debug_panel);
  lv_obj_set_style_text_font(ui_label_cpu1, &lv_font_montserrat_14, 0);
  lv_obj_set_style_text_color(ui_label_cpu1, lv_palette_main(LV_PALETTE_LIME), 0);
  lv_label_set_text(ui_label_cpu1, "C1:  0.0%");

  /* === Status Dashboard Panel === */
  lv_obj_t *panel_container = lv_obj_create(scr);
  lv_obj_set_size(panel_container, TFT_WIDTH - 20, 160);
  lv_obj_align(panel_container, LV_ALIGN_TOP_MID, 0, 50);
  lv_obj_add_flag(panel_container, LV_OBJ_FLAG_HIDDEN); 
  lv_obj_set_style_bg_opa(panel_container, LV_OPA_TRANSP, 0);
  lv_obj_set_style_border_width(panel_container, 0, 0);
  lv_obj_set_style_pad_all(panel_container, 0, 0);

  lv_obj_set_layout(panel_container, LV_LAYOUT_FLEX);
  lv_obj_set_flex_flow(panel_container, LV_FLEX_FLOW_ROW);
  lv_obj_set_flex_align(panel_container, LV_FLEX_ALIGN_SPACE_BETWEEN, LV_FLEX_ALIGN_START, LV_FLEX_ALIGN_START);

