zenes/esp32s3-TAS/esp-idf-examples/tas/main/main.cpp
      while (count < max_lines) {
        unsigned long ts = dmesg_buffer[idx].timestamp;
        LogLevel lvl = dmesg_buffer[idx].level;
        const char* msg = dmesg_buffer[idx].message;
        
        const char* lvl_str = "";
        switch(lvl) {
          case LOG_ERROR: lvl_str = "[ERROR]"; break;
          case LOG_WARN:  lvl_str = "[WARN ]"; break;
          case LOG_INFO:  lvl_str = "[INFO ]"; break;
          case LOG_DEBUG: lvl_str = "[DEBUG]"; break;
          default: break;
        }
        
        Serial.printf("[%6lu.%03lu] %s %s\r\n", ts / 1000, ts % 1000, lvl_str, msg);
        
        idx = (idx + 1) % DMESG_MAX_LINES;
        count++;
      }
      Serial.print("---------------------------\r\n\r\n");
    }
    else if (cmd.equalsIgnoreCase("monitor")) {
      if (arg.equalsIgnoreCase("on")) {
        monitor_enabled = true;
        Serial.print("Periodic monitoring: ON\r\n");
      } else if (arg.equalsIgnoreCase("off")) {
        monitor_enabled = false;
        Serial.print("Periodic monitoring: OFF\r\n");
      } else if (arg.equalsIgnoreCase("traffic")) {
        monitor_traffic = !monitor_traffic;
        Serial.printf("Traffic monitoring: %s\r\n", monitor_traffic ? "ON" : "OFF");
      } else {
        Serial.print("Usage: monitor <on/off/traffic>\r\n");
      }
    }
    else if (cmd.equalsIgnoreCase("loglevel")) {
      if (arg.length() > 0) {
        int val = arg.toInt();
        if (val >= 0 && val <= 4) {
          current_log_level = (LogLevel)val;
          Serial.printf("Log level changed to %d\r\n", val);
        } else {
          Serial.print("Error: Log level must be between 0 and 4.\r\n");
        }
      } else {
        Serial.printf("Current Log Level: %d\r\n", (int)current_log_level);
      }
    }
    else if (cmd.equalsIgnoreCase("restart")) {
      Serial.print("Restarting system...\r\n");
      delay(500);
      ESP.restart();
    } 
    else if (cmd.equalsIgnoreCase("set_ssid")) {
      if (arg.length() > 0) {
        ap_ssid_custom = arg;
        preferences.begin("wifi-config", false);
        preferences.putString("ssid", ap_ssid_custom);
        preferences.putString("password", ap_pw_custom); // Save both for consistency
        preferences.end();
        Serial.printf("Changing SSID to '%s'. Restarting AP...\r\n", ap_ssid_custom.c_str());
        
        WiFi.softAPdisconnect(false); // Don't turn off WiFi radio, just stop AP
        delay(100);
        WiFi.softAP(ap_ssid_custom.c_str(), ap_pw_custom.c_str(), AP_CHANNEL, 0, AP_MAX_CONN);
        updateLCD();
      } else {
        Serial.print("Error: No SSID provided. Usage: set_ssid <name>\r\n");
      }
    } 
    else if (cmd.equalsIgnoreCase("set_pw")) {
      if (arg.length() >= 8) {
        ap_pw_custom = arg;
        preferences.begin("wifi-config", false);
        preferences.putString("ssid", ap_ssid_custom);   // Save both for consistency
        preferences.putString("password", ap_pw_custom);
        preferences.end();
        Serial.printf("Changing Password to '%s'. Restarting AP...\r\n", ap_pw_custom.c_str());
        
        WiFi.softAPdisconnect(false); // Don't turn off WiFi radio, just stop AP
        delay(100);
        WiFi.softAP(ap_ssid_custom.c_str(), ap_pw_custom.c_str(), AP_CHANNEL, 0, AP_MAX_CONN);
      } else {
        Serial.print("Error: Password must be at least 8 characters. Usage: set_pw <pass>\r\n");
      }
    } 
#ifdef ENABLE_ETHERNET
    else if (cmd.equalsIgnoreCase("stats")) {
      Serial.println("\r\n--- Interface Statistics (Live) ---");
      Serial.printf("Free RAM: %u KB, Min: %u KB\r\n", ESP.getFreeHeap() / 1024, ESP.getMinFreeHeap() / 1024);
      
      Serial.println("[Ethernet]");
      Serial.printf("  RX: %s (%lu pkts)\r\n", formatBytes(eth_stats.rx_bytes).c_str(), eth_stats.rx_packets);
      Serial.printf("  TX: %s (%lu pkts)\r\n", formatBytes(eth_stats.tx_bytes).c_str(), eth_stats.tx_packets);
      
      Serial.println("[WiFi AP]");
      Serial.printf("  RX: %s (%lu pkts)\r\n", formatBytes(ap_stats.rx_bytes).c_str(), ap_stats.rx_packets);
      Serial.printf("  TX: %s (%lu pkts)\r\n", formatBytes(ap_stats.tx_bytes).c_str(), ap_stats.tx_packets);
      
      Serial.println("-----------------------------------\r\n");
    }
#endif
#ifdef ENABLE_ETHERNET
    else if (cmd.equalsIgnoreCase("traffic")) {
      if (arg.equalsIgnoreCase("on")) {
        traffic_log_enabled = true;
        installHooks(); // Ensure hooks are on
        Serial.println("Real-time traffic logging: ON");
      } else if (arg.equalsIgnoreCase("off")) {
        traffic_log_enabled = false;
        Serial.println("Real-time traffic logging: OFF");
      } else {
        Serial.println("\r\n--- Connected Stations ---");
        wifi_sta_list_t stationList;
        esp_wifi_ap_get_sta_list(&stationList);
        for (int i = 0; i < stationList.num; i++) {
          char macStr[18];
          snprintf(macStr, sizeof(macStr), "%02x:%02x:%02x:%02x:%02x:%02x",
                   stationList.sta[i].mac[0], stationList.sta[i].mac[1], stationList.sta[i].mac[2],
                   stationList.sta[i].mac[3], stationList.sta[i].mac[4], stationList.sta[i].mac[5]);
          Serial.printf("  [%d] MAC: %s, RSSI: %d\r\n", i+1, macStr, stationList.sta[i].rssi);
        }
        Serial.println("--------------------------\r\n");
      }
    }
#endif
    else if (cmd.equalsIgnoreCase("ping")) {
      if (arg.length() > 0) {
        ping_target = arg;
        ping_running = true;
        last_ping_time = 0; // Start immediately
        Serial.printf("Pinging %s (Infinite, press Ctrl+C to stop)...\r\n", ping_target.c_str());
      } else {
        Serial.print("Usage: ping <host>\r\n");
      }
    }
    else if (cmd.equalsIgnoreCase("top")) {
      if (arg.equalsIgnoreCase("off")) {
        top_running = false;
        Serial.println("System monitor: OFF");
      } else {
        top_running = true;
        last_top_time = 0; // Start immediately
        cpuStats.clear();
        Serial.println("System monitor: ON (Type 'top off' to stop)");
      }
    }
#ifdef ENABLE_ETHERNET
    else if (cmd.equalsIgnoreCase("ifconfig") || cmd.equalsIgnoreCase("ip")) {
      Serial.print("\r\n--- Interface Configuration ---\r\n");
      Serial.println("[ETH] Ethernet Interface:");
      Serial.printf("  Status: %s\r\n", eth_connected ? "UP" : "DOWN");
      if (eth_connected) {
        Serial.printf("  MAC   : %s\r\n", ETH.macAddress().c_str());
        Serial.printf("  IPv4  : %s\r\n", ETH.localIP().toString().c_str());
        Serial.printf("  Subnet: %s\r\n", ETH.subnetMask().toString().c_str());
        Serial.printf("  GW    : %s\r\n", ETH.gatewayIP().toString().c_str());
        Serial.printf("  DNS   : %s\r\n", ETH.dnsIP().toString().c_str());
      }
      
      Serial.println("\r\n[AP] WiFi Access Point:");
      Serial.printf("  Status: %s\r\n", ap_started ? "UP" : "DOWN");
      if (ap_started) {
        Serial.printf("  MAC   : %s\r\n", WiFi.softAPmacAddress().c_str());
        Serial.printf("  IPv4  : %s\r\n", WiFi.softAPIP().toString().c_str());
      }
      Serial.print("-------------------------------\r\n");
    }
#endif
    else if (cmd.equalsIgnoreCase("arp")) {
      Serial.print("\r\n--- AP ARP / Station List ---\r\n");
      wifi_sta_list_t stationList;
      esp_wifi_ap_get_sta_list(&stationList);
      if (stationList.num == 0) {
        Serial.println("  No clients connected.");
      } else {
        for (int i = 0; i < stationList.num; i++) {
          char macStr[18];
          snprintf(macStr, sizeof(macStr), "%02x:%02x:%02x:%02x:%02x:%02x",
                   stationList.sta[i].mac[0], stationList.sta[i].mac[1], stationList.sta[i].mac[2],
                   stationList.sta[i].mac[3], stationList.sta[i].mac[4], stationList.sta[i].mac[5]);
          Serial.printf("  [%d] MAC: %s, RSSI: %d\r\n", i+1, macStr, stationList.sta[i].rssi);
        }
      }
      Serial.print("-----------------------------\r\n");
    }
#ifdef ENABLE_ETHERNET
    else if (cmd.equalsIgnoreCase("dhcp")) {
      Serial.print("\r\n--- AP DHCP Leases ---\r\n");
#if ESP_ARDUINO_VERSION < ESP_ARDUINO_VERSION_VAL(3, 0, 0)
      esp_netif_t* ap_netif = esp_netif_get_handle_from_ifkey("WIFI_AP_DEF");
#else
      esp_netif_t* ap_netif = WiFi.AP.netif();
#endif
      wifi_sta_list_t stationList;
      esp_wifi_ap_get_sta_list(&stationList);

      if (ap_netif && stationList.num > 0) {
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
        esp_netif_pair_mac_ip_t mac_ip_pair[10]; 
        int num_clients = stationList.num > 10 ? 10 : stationList.num;
        
        // Prepare MAC addresses as input
        for (int i = 0; i < num_clients; i++) {
            memcpy(mac_ip_pair[i].mac, stationList.sta[i].mac, 6);
            mac_ip_pair[i].ip.addr = 0; // Clear IP initially
        }

        // ESP_OK (0) means success
        if (esp_netif_dhcps_get_clients_by_mac(ap_netif, num_clients, mac_ip_pair) == ESP_OK) {
          int count = 0;
          for (int i = 0; i < num_clients; i++) {
            if (mac_ip_pair[i].ip.addr != 0) {
              char macStr[18];
              snprintf(macStr, sizeof(macStr), "%02x:%02x:%02x:%02x:%02x:%02x",
                       mac_ip_pair[i].mac[0], mac_ip_pair[i].mac[1], mac_ip_pair[i].mac[2],
                       mac_ip_pair[i].mac[3], mac_ip_pair[i].mac[4], mac_ip_pair[i].mac[5]);
                       
