zenes/esp32s3-TAS/esp-idf-examples/tas/main/main.cpp
  // Step 8: Initialize Ethernet
#ifdef ENABLE_ETHERNET
  logMsg(LOG_INFO, "Step 8: Initializing Ethernet...");

#if CONFIG_IDF_TARGET_ESP32
  ETH.begin(ETH_TYPE, ETH_ADDR, ETH_MDC_PIN, ETH_MDIO_PIN, ETH_RESET_PIN, ETH_CLK_MODE);
#else
  ETH.begin(ETH_PHY_W5500, ETH_ADDR, ETH_CS_PIN, ETH_INT_PIN, ETH_RST_PIN,
            SPI2_HOST, ETH_SCLK_PIN, ETH_MISO_PIN, ETH_MOSI_PIN, 20);
#endif

#if USE_STATIC_IP
  ETH.config(local_ip, gateway, subnet, dns1, dns2);
#endif

  logMsg(LOG_INFO, "Ethernet initialization command sent");
  
  // Final Step: Install Hooks
  installHooks(); 
#else
  logMsg(LOG_WARN, "Step 8: Ethernet Feature Disabled (#define ENABLE_ETHERNET).");
#endif

  Serial.println("Waiting for Ethernet connection to enable internet sharing...");
  logMsg(LOG_INFO, "System ready. Type 'help' for commands.");
}

void loop() {
  // Print status every 5 seconds (Changed from 30 for debugging)
  static unsigned long lastStatusPrint = 0;
  unsigned long currentMillis = millis();

  if (currentMillis - lastStatusPrint >= 5000) {
    lastStatusPrint = currentMillis;

    if (monitor_enabled) {
      logMsg(LOG_INFO, "----- Status -----");
#ifdef ENABLE_ETHERNET
      logMsg(LOG_INFO, "Ethernet: %s", eth_connected ? "Connected" : "Disconnected");
      if (eth_connected) {
        logMsg(LOG_INFO, "  IP: %s", ETH.localIP().toString().c_str());
      }
#endif
      logMsg(LOG_INFO, "WiFi AP : %s", ap_started ? "Running" : "Stopped");
      if (ap_started) {
        logMsg(LOG_INFO, "  Clients: %d", WiFi.softAPgetStationNum());
      }
      logMsg(LOG_INFO, "------------------\r\n");
    }

#ifdef ENABLE_ETHERNET
    if (monitor_traffic) {
        unsigned long now = millis();
        if (now - last_speed_check >= 2000) {
          last_speed_check = now;
          Serial.printf("[Monitor] ETH RX: %s, TX: %s | AP RX: %s, TX: %s\r\n", 
                        formatBytes(eth_stats.rx_bytes).c_str(), formatBytes(eth_stats.tx_bytes).c_str(), 
                        formatBytes(ap_stats.rx_bytes).c_str(), formatBytes(ap_stats.tx_bytes).c_str());
        }
    }
#endif

    // Update LCD periodically
    updateLCD();
  }

  // Handle Serial Shell
  handleShell();

  // Handle UDP iPerf Reporting
#ifdef ENABLE_ETHERNET
  if (udp_iperf_running) {
    uint32_t now = millis();
    if (now - udp_iperf_last_print >= 1000) {
      // Calculate Mbps and MB/s
      float mbps = (udp_iperf_bytes * 8.0) / 1000000.0;
      float mb_s = udp_iperf_bytes / (1024.0 * 1024.0);
      
      Serial.printf("\r\n[UDP iPerf] %.2f MB/s  |  %.2f Mbps  (Received: %u Bytes)\r\n> ", mb_s, mbps, (unsigned int)udp_iperf_bytes);
      refreshLine();
      udp_iperf_bytes = 0; // Reset for next second
      udp_iperf_last_print = now;
    }
  }
#endif

  // Infinite Ping
  if (ping_running) {
    if (currentMillis - last_ping_time >= 1000) {
      last_ping_time = currentMillis;
      //bool success = Ping.ping(ping_target.c_str(), 1);
      //if (success) {
      //  Serial.printf("Reply from %s: time=%.2fms\r\n", ping_target.c_str(), 0.0);
      //} else {
      //  Serial.printf("Request timeout for %s\r\n", ping_target.c_str());
      //}
    }
  }

  // Real-time Top Monitoring
  if (top_running) {
    if (currentMillis - last_top_time >= 1000) {
      last_top_time = currentMillis;
      cpuStats.showTop();
    }
  }

  // Update LVGL tick and timer handler
  static uint32_t last_tick = 0;
  uint32_t now = millis();
  lv_tick_inc(now - last_tick);
  last_tick = now;
  lv_timer_handler();

  // Update FPS Label every 1 second independently
  static uint32_t last_fps_millis = 0;
  if (millis() - last_fps_millis >= 1000) {
    if (lcd_initialized && ui_label_fps) {
        fps_val = 60; // Use LVGL internal average FPS
        char buf_fps[32]; // 크기 늘림
        snprintf(buf_fps, sizeof(buf_fps), "FPS:%u  %ums", fps_val, last_render_time_ms);
        lv_label_set_text(ui_label_fps, buf_fps);
    }

    // CPU 시스템 부하 갱신 및 UI 업데이트 (Idle Hook + 10s Warm-up)
    cpuStats.update();
    if (lcd_initialized && ui_label_cpu0 && ui_label_cpu1) {
        char buf_cpu[24];
        if (!cpuStats.isReady()) {
            // warm-up 중: 깜빡이는 점으로 진행 중임을 표시
            static uint8_t dot_cycle = 0;
            if (++dot_cycle > 3) dot_cycle = 0;
            const char* dots[] = {"C0: .", "C0: ..", "C0: ...", "C0:    "};
            lv_label_set_text(ui_label_cpu0, dots[dot_cycle]);
            lv_label_set_text(ui_label_cpu1, "C1: cal");
        } else {
            snprintf(buf_cpu, sizeof(buf_cpu), "C0:%5.1f%%", cpuStats.getLoad(0));
            lv_label_set_text(ui_label_cpu0, buf_cpu);
            snprintf(buf_cpu, sizeof(buf_cpu), "C1:%5.1f%%", cpuStats.getLoad(1));
            lv_label_set_text(ui_label_cpu1, buf_cpu);
        }
    }
    
#ifdef ENABLE_TE_SYNC
    if (lcd_initialized && ui_label_te) {
        int64_t delta_us = te_delta_us;
        if (delta_us > 0) {
            float te_ms = delta_us / 1000.0f;
            float te_hz = 1000000.0f / delta_us;
            char buf_te[32];
            snprintf(buf_te, sizeof(buf_te), "TE: %.1fms(%.1fHz)", te_ms, te_hz);
            lv_label_set_text(ui_label_te, buf_te);
        }
    }
#endif
    last_fps_millis = millis();
  }

  // Minimal delay for system stability while maximizing loop throughput
  yield(); 
}


extern "C" void app_main() {
    initArduino();
    setup();
    while(1) {
        loop();
        vTaskDelay(pdMS_TO_TICKS(1));
    }
}
